i = int(input())

print("\n以下出力")
print("3で割り切れるか→0なら出力", i % 3)
if i / 1000 >= 1:
	print("1000以上の数字")
	print("1000の位の数字→3なら出力", int(i / 1000))
	print("100の位以下の数字", i % 1000)
	print("100の位の数字→3なら出力", int(i % 1000 / 100))
	print("10の位以下の数字", i % 1000 % 100)
	print("10の位の数字→3なら出力", int(i % 1000 % 100 / 10))
	print("1の位の数字→3なら出力", i % 1000 % 100 % 10)
elif i / 100 >= 1:
	print("100以上の数字")
	print("100の位の数字→3なら出力", int(i / 100))
	print("10の位以下の数字", i % 100)
	print("10の位の数字→3なら出力", int(i % 100 / 10))
	print("1の位の数字→3なら出力", i % 100 % 10)
elif i / 10 >= 1:
	print("10以上の数字")
	print("10の位の数字→3なら出力", int(i / 10))
	print("1の位の数字→3なら出力", i % 10)
